# WeatherFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSystemsAnalysisReport..::..WeatherFile Property
ViewSystemsAnalysisReport Class See Also
---
The full path name of the weather file used for the systems analysis.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public string WeatherFile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WeatherFile As String
	Get
```

Visual C++
---
```text
public:
property String^ WeatherFile {
	String^ get ();
}
```

# See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace